export const getInfoAboutSpecialistById = async (id) => {
  const mockSpecialistsInfo = [
    {
      id: 1,
      specialization: 'psychologist',
      video: '',
      description:
        'Привіт! Я Юля, психолог із двома роками досвіду роботи. Я люблю ділитися теплом \n' +
        'і комфортом. При цьому використовую в\n' +
        'роботі науково доказові методи та постійно\n' +
        'слідкую за дослідженнями і вдосконалюю\n' +
        'свої знання. Розумію, як у сучасному. . .',
      work: 'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Expedita, tempore.\n',
      qualifications: ['Психолог', 'Сексолог'],
      approaches: ['КПТ', 'Гештальт', 'Психодрама'],
      reviews: {
        avatar: 'K',
        name: 'Елизавета',
        date: '2 місяці тому',
        stars: '5',
        comment:
          'Юлія добре знайшла підхід до мене і я\n' +
          'відчула полегшення навіть вже після першої\n' +
          'сесії. Хороша КПТ психологиня, знає свою\n' +
          'справу. Щиро рекомендую',
      },
      language: ['Українська', 'Російська'],
      therapy: ['Особиста', 'Парна'],
      experience: {
        education:
          'Волинський національний університет імені\n' +
          'Лесі Українки, психологічний факультет,\n' +
          'спеціальність «Практична психологія»',
        certificates: [
          '/src/assets/icons/specialist-page/certificates/1.jpg',
          '/src/assets/icons/specialist-page/certificates/2.jpg',
          '/src/assets/icons/specialist-page/certificates/3.jpg',
          '/src/assets/icons/specialist-page/certificates/4.jpg',
        ],
        courses:
          '• Український інститут когнітивно-\n' +
          'поведінкової терапії, програма КПТ+\n' +
          '• Міжнародний інститут психології\n' +
          'курс «Психологічна допомога в умовах війни»\n' +
          '• Міжнародний інститут психології\n' +
          'курс «Страх, сором, провина»\n' +
          '• Курс «Горе і втрата»\n' +
          '• Курс «Проведення інтерв’ю з урахуванням\n' +
          'психологічної травми: навички та прийоми»',
        other:
          'Постійно слідкую за науковими дослідами. \n' +
          'Отримую нову інформацію у сфері психології \n' +
          'ще до того, як вона з’явиться в україномовних\n' +
          'джерелах. Є слухачем різних лекцій, семінарів \n' +
          'та курсів. Маю досвід власної терапії.',
      },
    },
    {
      id: 2,
      specialization: 'psychologist',
      video: '',
      description:
        'Привіт! Я Юля, психолог із двома роками досвіду роботи. Я люблю ділитися теплом \n' +
        'і комфортом. При цьому використовую в\n' +
        'роботі науково доказові методи та постійно\n' +
        'слідкую за дослідженнями і вдосконалюю\n' +
        'свої знання. Розумію, як у сучасному. . .',
      work: 'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Expedita, tempore.\n',
      qualifications: ['Психолог', 'Сексолог'],
      approaches: ['КПТ', 'Гештальт', 'Психодрама'],
      reviews: {
        avatar: 'K',
        name: 'Елизавета',
        date: '2 місяці тому',
        stars: '5',
        comment:
          'Юлія добре знайшла підхід до мене і я\n' +
          'відчула полегшення навіть вже після першої\n' +
          'сесії. Хороша КПТ психологиня, знає свою\n' +
          'справу. Щиро рекомендую',
      },
      language: ['Українська', 'Російська'],
      therapy: ['Особиста', 'Парна'],
      experience: {
        education:
          'Волинський національний університет імені\n' +
          'Лесі Українки, психологічний факультет,\n' +
          'спеціальність «Практична психологія»',
        certificates: [
          '/src/assets/icons/specialist-page/certificates/1.jpg',
          '/src/assets/icons/specialist-page/certificates/2.jpg',
          '/src/assets/icons/specialist-page/certificates/3.jpg',
          '/src/assets/icons/specialist-page/certificates/4.jpg',
        ],
        courses:
          '• Український інститут когнітивно-\n' +
          'поведінкової терапії, програма КПТ+\n' +
          '• Міжнародний інститут психології\n' +
          'курс «Психологічна допомога в умовах війни»\n' +
          '• Міжнародний інститут психології\n' +
          'курс «Страх, сором, провина»\n' +
          '• Курс «Горе і втрата»\n' +
          '• Курс «Проведення інтерв’ю з урахуванням\n' +
          'психологічної травми: навички та прийоми»',
        other:
          'Постійно слідкую за науковими дослідами. \n' +
          'Отримую нову інформацію у сфері психології \n' +
          'ще до того, як вона з’явиться в україномовних\n' +
          'джерелах. Є слухачем різних лекцій, семінарів \n' +
          'та курсів. Маю досвід власної терапії.',
      },
    },
    {
      id: 3,
      specialization: 'psychologist',
      video: '',
      description:
        'Привіт! Я Юля, психолог із двома роками досвіду роботи. Я люблю ділитися теплом \n' +
        'і комфортом. При цьому використовую в\n' +
        'роботі науково доказові методи та постійно\n' +
        'слідкую за дослідженнями і вдосконалюю\n' +
        'свої знання. Розумію, як у сучасному. . .',
      work: 'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Expedita, tempore.\n',
      qualifications: ['Психолог', 'Сексолог'],
      approaches: ['КПТ', 'Гештальт', 'Психодрама'],
      reviews: {
        avatar: 'K',
        name: 'Елизавета',
        date: '2 місяці тому',
        stars: '5',
        comment:
          'Юлія добре знайшла підхід до мене і я\n' +
          'відчула полегшення навіть вже після першої\n' +
          'сесії. Хороша КПТ психологиня, знає свою\n' +
          'справу. Щиро рекомендую',
      },
      language: ['Українська', 'Російська'],
      therapy: ['Особиста', 'Парна'],
      experience: {
        education:
          'Волинський національний університет імені\n' +
          'Лесі Українки, психологічний факультет,\n' +
          'спеціальність «Практична психологія»',
        certificates: [
          '/src/assets/icons/specialist-page/certificates/1.jpg',
          '/src/assets/icons/specialist-page/certificates/2.jpg',
          '/src/assets/icons/specialist-page/certificates/3.jpg',
          '/src/assets/icons/specialist-page/certificates/4.jpg',
        ],
        courses:
          '• Український інститут когнітивно-\n' +
          'поведінкової терапії, програма КПТ+\n' +
          '• Міжнародний інститут психології\n' +
          'курс «Психологічна допомога в умовах війни»\n' +
          '• Міжнародний інститут психології\n' +
          'курс «Страх, сором, провина»\n' +
          '• Курс «Горе і втрата»\n' +
          '• Курс «Проведення інтерв’ю з урахуванням\n' +
          'психологічної травми: навички та прийоми»',
        other:
          'Постійно слідкую за науковими дослідами. \n' +
          'Отримую нову інформацію у сфері психології \n' +
          'ще до того, як вона з’явиться в україномовних\n' +
          'джерелах. Є слухачем різних лекцій, семінарів \n' +
          'та курсів. Маю досвід власної терапії.',
      },
    },
    {
      id: 5,
      specialization: 'esoteric',
      video: '',
      description:
        'Привіт! Я Юля, психолог із двома роками досвіду роботи. Я люблю ділитися теплом \n' +
        'і комфортом. При цьому використовую в\n' +
        'роботі науково доказові методи та постійно\n' +
        'слідкую за дослідженнями і вдосконалюю\n' +
        'свої знання. Розумію, як у сучасному. . .',
      work: 'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Expedita, tempore.\n',
      qualifications: ['Космоенергет', 'Регресолог'],
      language: ['Українська', 'Російська'],
      reviews: {
        avatar: 'K',
        name: 'Елизавета',
        date: '2 місяці тому',
        stars: '5',
        comment:
          'Юлія добре знайшла підхід до мене і я\n' +
          'відчула полегшення навіть вже після першої\n' +
          'сесії. Хороша КПТ психологиня, знає свою\n' +
          'справу. Щиро рекомендую',
      },
    },
    {
      id: 6,
      specialization: 'esoteric',
      video: '',
      description:
        'Привіт! Я Юля, психолог із двома роками досвіду роботи. Я люблю ділитися теплом \n' +
        'і комфортом. При цьому використовую в\n' +
        'роботі науково доказові методи та постійно\n' +
        'слідкую за дослідженнями і вдосконалюю\n' +
        'свої знання. Розумію, як у сучасному. . .',
      work: 'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Expedita, tempore.\n',
      qualifications: ['Космоенергет', 'Регресолог'],
      language: ['Українська', 'Російська'],
      reviews: {
        avatar: 'K',
        name: 'Елизавета',
        date: '2 місяці тому',
        stars: '5',
        comment:
          'Юлія добре знайшла підхід до мене і я\n' +
          'відчула полегшення навіть вже після першої\n' +
          'сесії. Хороша КПТ психологиня, знає свою\n' +
          'справу. Щиро рекомендую',
      },
    },
  ];

  return new Promise((resolve, reject) => {
    setTimeout(() => {
      const specialist = mockSpecialistsInfo.find((s) => s.id === id);
      if (specialist) {
        resolve(specialist);
      } else {
        reject(new Error('not found'));
      }
    }, 500); // задержку сделал типа с сервака, потом удалить
  });
};
