export const getReviews = async () => {
  return new Promise((resolve) => {
    setTimeout(() => {
      resolve([
        {
          id: 1,
          avatar: 'K',
          name: 'Елизавета',
          date: '2 місяці тому',
          stars: '5',
          comment:
            'Юлія добре знайшла підхід до мене і я\n' +
            'відчула полегшення навіть вже після першої\n' +
            'сесії. Хороша КПТ психологиня, знає свою\n' +
            'справу. Щиро рекомендую',
        },
        {
          id: 2,
          avatar: '/src/assets/icons/specialist-page/Sergei.jpg',
          name: 'Сергій',
          date: '3 місяці тому',
          stars: '5',
          comment:
            'Тільки почали роботу з Юлією. Подобається\n' +
            'структурованість в роботі. В цілому приємний та\n' +
            'позитивний досвід. Буду продовжувати сеанси',
        },
        {
          id: 3,
          avatar: 'О',
          name: 'Ольга',
          date: '6 місяців тому',
          stars: '5',
          comment: 'Була одна сесія. Я задоволена',
        },
      ]);
    }, 500); // задержку сделал типа с сервака, потом удалить
  });
};
